import { useState, useEffect } from "react"
import { useParams } from "react-router-dom"

import Loader from "../components/Loader"
import Navbar from "../components/Navbar"
import Footer from "../components/Footer"
import CourseDetail from "../components/CourseDetail"

import { cSharpCourse, pythonCourse, frontEndCourse } from "../assets"

function CourseDetailPage() {
  const courseId = useParams().courseId
  const courseData = [
    {
      id: 1,
      image: frontEndCourse,
      title: "دوره طراحی وبسایت",
      desc: ` طراحی وبسایت و بخش فرانت‌اند به عنوان یکی از مهمترین جنبه‌های توسعه وب، به طراحی، ساخت و اجرای رابط کاربری یک وبسایت می‌پردازد. HTML، CSS و JavaScript به عنوان سه عنصر اصلی در این فرآیند مطرح هستند. 
 
HTML (HyperText Markup Language) به عنوان زبان برنامه‌نویسی اصلی برای ساختاردهی و محتوای یک صفحه وب استفاده می‌شود. این زبان با استفاده از تگ‌ها و عناصر مختلف، ساختار صفحات وب را تعریف می‌کند.
 
CSS (Cascading Style Sheets) وظیفه استایل‌دهی و زیباسازی صفحات HTML را بر عهده دارد. این زبان با استفاده از قوانین و خصوصیت‌های مختلف، اندازه، رنگ، فونت، فضا و سایر ویژگی‌های ظاهری صفحه وب را تعیین می‌کند.
 
JavaScript به عنوان یک زبان برنامه‌نویسی کلاینت ساید، وظیفه ایجاد تعامل و پویایی در صفحات وب را بر عهده دارد. این زبان می‌تواند وظایف مختلفی مانند اعتبارسنجی فرم‌ها، ایجاد انیمیشن‌ها، افزودن واسط کاربری تعاملی و بسیاری وظایف دیگر را بر عهده داشته باشد.

طراحی وبسایت با استفاده از این ابزارها و زبان‌های برنامه‌نویسی، به طور کلی به ایجاد یک تجربه کاربری مطلوب، زیبا و کارآمد می‌پردازد. با استفاده از HTML، صفحه وب ساخته می‌شود، CSS به آن ظاهری زیبا و مناسب می‌بخشد و JavaScript تعاملات و پویایی‌های لازم را فراهم می‌کند. این فرآیند نه تنها از جنبه فنی مهم است، بلکه نقش بسیار مهمی در تجربه کاربری و موفقیت یک وبسایت نیز دارد.`,
      courseDetailsTitle: "سرفصل‌های دوره مقدماتی طراحی وبسایت",

      courseDetails: [
        {
          title: "مقدمه به HTML، CSS و JavaScript",
          details: [
            "آشنایی با HTML و اجزای اصلی",
            "استفاده از CSS برای زیبایی‌بخشی به صفحات وب",
            "مفاهیم اولیه JavaScript و کاربردهای آن",
          ],
        },
        {
          title: "طراحی و استایل دهی با CSS",
          details: [
            "انواع انتخابگرها و انتقال‌دهنده‌ها",
            "طراحی و ساختاردهی صفحات با Flexbox و Grid",
            "استفاده از CSS پیشرفته برای ایجاد انیمیشن‌ها و تغییرات پیچیده",
          ],
        },
        {
          title: "برنامه‌نویسی با JavaScript",
          details: [
            "مبانی JavaScript: متغیرها، عملگرها، و شرط‌ها",
            "کنترل جریان برنامه و حلقه‌ها",
            "DOM Manipulation و رویدادها",
          ],
        },
        {
          title: "پروژه‌های عملی طراحی وب",
          details: [
            "طراحی و ایجاد یک وبسایت استاتیک",
            "پیاده‌سازی وبسایت پویا با استفاده از JavaScript",
            "بهینه‌سازی و رفع اشکالات در وبسایت",
          ],
        },
        {
          title: "واکنشگرایی و ریسپانسیو بودن",
          details: [
            "مفاهیم واکنشگرایی در طراحی وبسایت",
            "تکنیک‌ها و ابزارهایی برای ساخت سایت‌های ریسپانسیو",
          ],
        },
        {
          title: "بهینه‌سازی و بهبود عملکرد وبسایت",
          details: [
            "استفاده از ابزارها و تکنیک‌های بهینه‌سازی وب",
            "مدیریت فایل‌ها و بهینه‌سازی تصاویر",
          ],
        },
        {
          title: "به اشتراک گذاری و انتشار وبسایت",
          details: [
            "آماده‌سازی و انتشار وبسایت بر روی هاست",
            "افزایش دسترسی و شناخت وبسایت توسط موتورهای جستجو",
          ],
        },
      ],

      prerequisite: "بدون پیش نیاز",
      level: "مقدماتی",
      courseTime: 23,
      teacher: "دکتر علیرضا اسلامی زاد",
      place: "آنلاین - اسکایپ",
      date: "1402/12/09",
      price: "1,000,000",
      status: "در حال برگزاری",
      link: "https://docs.google.com/forms",
      enabled: false,
    },
    {
      id: 2,
      image: cSharpCourse,
      title: "دوره C#",
      desc: `زبان برنامه‌نویسی C# یکی از زبان‌های برنامه‌نویسی شیء‌گرا و تحت مدیریت شرکت مایکروسافت است که برای توسعه نرم‌افزارهای متنوع از جمله برنامه‌های دسکتاپ، وب، و موبایل استفاده می‌شود. C# یک زبان بسیار قدرتمند، انعطاف‌پذیر و با عملکرد بالا است که قابلیت‌هایی چون ایمنی نوع‌ها، ارث‌بری، پلی‌مورفیسم و مدیریت حافظه را فراهم می‌کند. این زبان از زیرساخت‌های مدرنی برخوردار است که توسعه دهندگان را قادر می‌سازد به راحتی و با کارایی بالا برنامه‌های متنوع و پیچیده را طراحی، پیاده‌سازی و مدیریت کنند.`,
      courseDetailsTitle: "سرفصل‌های دوره مقدماتی C#",
      courseDetails: [
        {
          title: "مقدمه به C#",
          details: ["تاریخچه و معرفی اولیه", "محیط توسعه (IDE) و نصب C#"],
        },
        {
          title: "اساسیات برنامه‌نویسی",
          details: ["متغیرها و انواع داده‌ها", "عملگرها و عبارات شرطی"],
        },
        {
          title: "ساختار داده",
          details: ["آرایه‌ها و رشته‌ها", "لیست‌ها و دیکشنری‌ها"],
        },
        {
          title: "توابع و متدها",
          details: ["تعریف و استفاده از توابع", "پارامترها و بازگشت مقادیر"],
        },
        {
          title: "شیءگرایی و کلاس‌ها",
          details: ["مبانی شیءگرایی", "تعریف کلاس و اشیاء"],
        },
        {
          title: "ورودی و خروجی",
          details: ["ورودی از کاربر", "نمایش خروجی"],
        },
        {
          title: "استثناءها و اشکال زدایی",
          details: [
            "مدیریت خطاها و استثناءها",
            "رفع اشکال (Debugging) در برنامه",
          ],
        },
        {
          title: "فایل‌ها و ورود/خروج داده",
          details: ["خواندن و نوشتن اطلاعات به فایل‌ها"],
        },
      ],

      prerequisite: "آشنایی به الگوریتم و فلوچارت",
      level: "مقدماتی",
      courseTime: 10,
      teacher: "دکتر علیرضا اسلامی زاد",
      place: "آنلاین - اسکایپ",
      date: "1402/12/09",
      price: 0,
      status: "در حال ثبت نام",
      link: `https://docs.google.com/forms`,
      enabled: true,
    },
    {
      id: 3,
      image: pythonCourse,
      title: "دوره Python",
      desc: `زبان برنامه‌نویسی پایتون یک زبان بسیار پرکاربرد، قابل فهم و قدرتمند است که برای توسعه نرم‌افزارهای متنوع از جمله وب، علوم داده، هوش مصنوعی، اتوماسیون، و توسعه اپلیکیشن‌های موبایل استفاده می‌شود. یکی از مزایای بزرگ پایتون، خوانایی و سادگی بالای زبان است که باعث می‌شود حتی برای مبتدیان نیز آموزش و استفاده از آن راحت باشد. پایتون به عنوان یک زبان توسعه سریع (Rapid Development) شناخته می‌شود؛ به دلیل داشتن تعداد زیادی کتابخانه و ابزارهای آماده که امکانات بسیاری را برای توسعه‌دهندگان فراهم می‌کنند. علاوه بر این، پایتون به عنوان یک زبان کراس پلتفرم است که به راحتی روی سیستم‌های مختلف اجرا می‌شود و قابلیت اتصال و ادغام با سایر زبان‌ها و فناوری‌ها را دارد، که این ویژگی باعث محبوبیت بیشتر آن در صنعت برنامه‌نویسی شده است.`,
      courseDetailsTitle: "سرفصل‌های دوره مقدماتی Python",
      courseDetails: [
        {
          title: "مقدمه به پایتون",
          details: ["تاریخچه و معرفی اولیه", "محیط توسعه (IDE) و نصب پایتون"],
        },
        {
          title: "اساسیات برنامه‌نویسی",
          details: ["متغیرها و انواع داده‌ها", "عملگرها و عبارات شرطی"],
        },
        {
          title: "ساختار داده",
          details: ["لیست‌ها و تاپل‌ها", "دیکشنری‌ها و مجموعه‌ها"],
        },
        {
          title: "توابع و متدها",
          details: ["تعریف و استفاده از توابع", "پارامترها و بازگشت مقادیر"],
        },
        {
          title: "شیءگرایی و کلاس‌ها",
          details: ["مبانی شیءگرایی", "تعریف کلاس و اشیاء"],
        },
        {
          title: "ورودی و خروجی",
          details: ["ورودی از کاربر", "نمایش خروجی"],
        },
        {
          title: "استثناءها و اشکال زدایی",
          details: [
            "مدیریت خطاها و استثناءها",
            "رفع اشکال (Debugging) در برنامه",
          ],
        },
        {
          title: "فایل‌ها و ورود/خروج داده",
          details: ["خواندن و نوشتن اطلاعات به فایل‌ها"],
        },
      ],
      prerequisite: "آشنایی به مبانی برنامه نویسی",
      level: "مقدماتی",
      courseTime: 16,
      teacher: "دکتر علیرضا اسلامی زاد",
      place: "آنلاین - اسکایپ",
      date: "1402/12/09",
      price: "500,000",
      status: "اتمام دوره",
      link: "https://docs.google.com/forms",
      enabled: false,
    },
  ]

  const [isLoading, setIsLoading] = useState(true)

  useEffect(() => {
    setTimeout(() => {
      setIsLoading(false)
    }, 1000)
  }, [])

  return (
    <>
      {isLoading ? <Loader /> : <> </>}
      <Navbar />
      <CourseDetail {...courseData[courseId - 1]} />
      <Footer />
    </>
  )
}

export default CourseDetailPage
